DataProcessors/ТестированиеЗнаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ТестированиеЗнаний</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Enums/ВидыЭтаповВосхождения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыЭтаповВосхождения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВратаСпешки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Головоломка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КолесоСудьбы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отдых</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Противник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сокровище</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Торговец</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СложностиПротивников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СложностиПротивников</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Начальная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обычная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Элитная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Босс</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Противники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Противники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МаксимальноеЗдоровье</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешнийID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сложность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СложностиПротивников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДействияЦикла</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДействиеЦикла</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыДействийПротивников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МинимальнаяСила</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальнаяСила</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ТестированиеЗнаний/Forms/ФормаВыбораЭтапа/Ext/Form/Module.bsl
&НаСервере
Перем Гсч;		// Генератор случайных чисел.

&НаКлиенте
Процедура ВыбратьЭтап(Команда)
	// Получаем выбранную строку из таблицы этапов
	ТекДанные = Элементы.ТаблицаЭтапов.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		// Возвращаем результат через структуру
		Результат = Новый Структура;
		Результат.Вставить("ВидЭтапа",	 ТекДанные.ВидЭтапа);
		Результат.Вставить("Противник",	 ТекДанные.Противник);
		Результат.Вставить("НомерЭтапа", НомерЭтапа + 1);
		// Записываем результат и закрываем форму
		Модифицированность = Ложь;
		Закрыть(Результат);
	Иначе
		Предупреждение("Выберите этап из списка.");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Инициализация генератора случайных чисел
	Гсч = Новый ГенераторСлучайныхЧисел(ТекущаяУниверсальнаяДатаВМиллисекундах());
	// Считываем параметры формы.
	ВсегоЭтапов				 = Параметры.ВсегоЭтапов;
	НомерЭтапа				 = Параметры.НомерЭтапа;
	Золото					 = Параметры.Золото;
	МаксимальноеЗдоровье	 = Параметры.МаксимальноеЗдоровье;
	ТекущееЗдоровье			 = Параметры.ТекущееЗдоровье;
	// Считываем предыдущие значения противника и вида этапа
	Если Параметры.Свойство("ПредыдущийПротивник") Тогда
		ПредыдущийПротивник = Параметры.ПредыдущийПротивник;
	КонецЕсли;
	Если Параметры.Свойство("ПредыдущийВидЭтапа") Тогда
		ПредыдущийВидЭтапа = Параметры.ПредыдущийВидЭтапа;
		Если ПредыдущийВидЭтапа <> Перечисления.ВидыЭтаповВосхождения.Противник Тогда
			ПредыдущийПротивник = Справочники.Противники.ПустаяСсылка();
		Иначе
			// Не очищаем противника.
		КонецЕсли;	
	КонецЕсли;
	// Формирование заголовка декорации.
	Элементы.ДекорацияНомерЭтапа.Заголовок = Строка(НомерЭтапа) + "/" + Строка(ВсегоЭтапов);
	// Заполнение таблицы этапов
	ЗаполнитьТаблицуЭтапов();
КонецПроцедуры

// Возвращает случайный вид этапа по заданному распределению вероятностей.
// Распределение: Противник 63%, Торговец 5%, Головоломка 20%, Врата спешки 3%, Отдых 5%, Сокровище 4%.
//
// Возвращаемое значение:
//  ПеречислениеСсылка.ВидыЭтаповВосхождения - случайный вид этапа.
//
&НаСервере
Функция ПолучитьСлучайныйВидЭтапа()
	СлучайноеЗначение = Гсч.СлучайноеЧисло(0, 99);
	Если СлучайноеЗначение < 63 Тогда
		РезультатФункции = Перечисления.ВидыЭтаповВосхождения.Противник;
	ИначеЕсли СлучайноеЗначение < 68 Тогда
		РезультатФункции = Перечисления.ВидыЭтаповВосхождения.Торговец;
	ИначеЕсли СлучайноеЗначение < 88 Тогда
		РезультатФункции = Перечисления.ВидыЭтаповВосхождения.Головоломка;
	ИначеЕсли СлучайноеЗначение < 91 Тогда
		РезультатФункции = Перечисления.ВидыЭтаповВосхождения.ВратаСпешки;
	ИначеЕсли СлучайноеЗначение < 96 Тогда
		РезультатФункции = Перечисления.ВидыЭтаповВосхождения.Отдых;
	Иначе
		РезультатФункции = Перечисления.ВидыЭтаповВосхождения.Сокровище;
	КонецЕсли;
	Возврат РезультатФункции;
КонецФункции

// Возвращает случайный вид этапа без дубликатов (кроме Противник), учитывая уже использованные виды.
// Этап Врата спешки заменяется на Противник, если номер этапа превышает максимальный.
//
// Параметры:
//  ИспользованныеВидыЭтаповИзм          - Массив - список уже использованных видов (кроме Противник), дополняется новым видом.
//  НомерЭтапаВход                       - Число - номер текущего этапа.
//  МаксимальныйНомерЭтапаВратаСпешкиВход - Число - максимальный номер этапа, на котором доступны Врата спешки.
//
// Возвращаемое значение:
//  ПеречислениеСсылка.ВидыЭтаповВосхождения - уникальный случайный вид этапа.
//
&НаСервере
Функция ПолучитьУникальныйВидЭтапа(ИспользованныеВидыЭтаповИзм, НомерЭтапаВход, МаксимальныйНомерЭтапаВратаСпешкиВход)
	ПовторятьГенерацию = Истина;
	Пока ПовторятьГенерацию Цикл
		ВидЭтапа = ПолучитьСлучайныйВидЭтапа();
		// Запрет этапа Врата спешки для этапа больше максимального.
		ЭтоВратаСпешки = (ВидЭтапа = Перечисления.ВидыЭтаповВосхождения.ВратаСпешки);
		МаксимальныйНомерПревышен = НомерЭтапаВход > МаксимальныйНомерЭтапаВратаСпешкиВход;
		Если МаксимальныйНомерПревышен И ЭтоВратаСпешки Тогда
			ВидЭтапа = Перечисления.ВидыЭтаповВосхождения.Противник;
		Иначе
			// Вид этапа остаётся без изменений.
		КонецЕсли;
		// Проверка на дубликат (кроме Противник).
		ЭтоПротивник = (ВидЭтапа = Перечисления.ВидыЭтаповВосхождения.Противник);
		Если ЭтоПротивник Тогда
			ПовторятьГенерацию = Ложь;
		ИначеЕсли ИспользованныеВидыЭтаповИзм.Найти(ВидЭтапа) = Неопределено Тогда
			ИспользованныеВидыЭтаповИзм.Добавить(ВидЭтапа);
			ПовторятьГенерацию = Ложь;
		Иначе
			// Дубликат. Генерируем заново.
		КонецЕсли;
	КонецЦикла;
	Возврат ВидЭтапа;
КонецФункции

// Осуществляет заполнение таблицы этапов.
//
&НаСервере
Процедура ЗаполнитьТаблицуЭтапов()
	// Инициализация.
	ЧислоЭтаповДляВыбора = 3;
	МаксимальныйНомерЭтапаВратаСпешки = 23;
	НомерЭтапаТорговца = 29;
	НомерСледующегоЭтапа = НомерЭтапа + 1;
	ЭтоЭтапТорговца = (НомерСледующегоЭтапа = НомерЭтапаТорговца);
	Если ЭтоЭтапТорговца Тогда
		ЧислоЭтаповДляВыбора = 1;
	Иначе
		// Для остальных этапов предлагается три варианта.
	КонецЕсли;
	// Инициализация таблицы этапов
	ТаблицаЭтапов.Очистить();
	// Список использованных видов этапов (кроме Противник) для исключения дубликатов.
	ИспользованныеВидыЭтапов = Новый Массив;
	// Заполняем таблицу этапов строками
	Для Индекс = 1 По ЧислоЭтаповДляВыбора Цикл
		ЭтоЭлитнаяСложность = Обработки.ТестированиеЗнаний.ЭтоЭтапЭлитнойСложности(НомерСледующегоЭтапа);
		НоваяСтрока = ТаблицаЭтапов.Добавить();
		Если ЭтоЭтапТорговца Тогда
			ВидЭтапа = Перечисления.ВидыЭтаповВосхождения.Торговец;
		ИначеЕсли ЭтоЭлитнаяСложность Тогда
			ВидЭтапа = Перечисления.ВидыЭтаповВосхождения.Противник;
		Иначе
			ВидЭтапа = ПолучитьУникальныйВидЭтапа(ИспользованныеВидыЭтапов, НомерЭтапа, МаксимальныйНомерЭтапаВратаСпешки);
		КонецЕсли;
		НоваяСтрока.ВидЭтапа = ВидЭтапа;
		// Если выбран вид этапа "Противник", заполняем поле Противник
		Если НоваяСтрока.ВидЭтапа = Перечисления.ВидыЭтаповВосхождения.Противник Тогда
			Если НомерЭтапа <= 5 Тогда
				СложностьДляПротивника = Перечисления.СложностиПротивников.Начальная;
			Иначе
				Если ЭтоЭлитнаяСложность Тогда
					СложностьДляПротивника = Перечисления.СложностиПротивников.Элитная;
				Иначе
					СложностьДляПротивника = Перечисления.СложностиПротивников.Обычная;
				КонецЕсли;
			КонецЕсли;
			НоваяСтрока.Противник = Справочники.Противники.ПолучитьСлучайногоПротивника(Гсч, СложностьДляПротивника);
		Иначе
			НоваяСтрока.Противник = Справочники.Противники.ПустаяСсылка();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Размещает описание выбранного этапа на форме.
//
// Параметры:
//	ВидЭтапаВход - ПеречисленияСсылка.ВидыЭтаповВосхождения - Вид этапа, описание которого готовится.
//
&НаКлиенте
Процедура ЗагрузитьОписаниеЭтапа(ВидЭтапаВход)
	Если ВидЭтапаВход = ПредопределенноеЗначение("Перечисление.ВидыЭтаповВосхождения.Противник") Тогда
		Описание = "Битва с выбранным противником";
	ИначеЕсли ВидЭтапаВход = ПредопределенноеЗначение("Перечисление.ВидыЭтаповВосхождения.ВратаСпешки") Тогда
		Описание = "Пропустить 4 следующих этапа";
	ИначеЕсли ВидЭтапаВход = ПредопределенноеЗначение("Перечисление.ВидыЭтаповВосхождения.Отдых") Тогда
		Описание = "Восстановить 30% здоровья";
	ИначеЕсли ВидЭтапаВход = ПредопределенноеЗначение("Перечисление.ВидыЭтаповВосхождения.Сокровище") Тогда
		Описание = "Получить случайный модификатор";
	ИначеЕсли ВидЭтапаВход = ПредопределенноеЗначение("Перечисление.ВидыЭтаповВосхождения.Торговец") Тогда	
		Описание = "Торговать за золото";
	ИначеЕсли ВидЭтапаВход = ПредопределенноеЗначение("Перечисление.ВидыЭтаповВосхождения.КолесоСудьбы") Тогда
		Описание = "Испытать удачу в колесе судьбы";
	ИначеЕсли ВидЭтапаВход = ПредопределенноеЗначение("Перечисление.ВидыЭтаповВосхождения.Головоломка") Тогда
		Описание = "Решить головоломку на память";
	Иначе
		Описание = "";
	КонецЕсли;
КонецПроцедуры		// ЗагрузитьОписаниеЭтапа()

&НаКлиенте
Процедура ТаблицаЭтаповПриАктивизацииСтроки(Элемент)
	ТекДанные = Элементы.ТаблицаЭтапов.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ТекВидЭтапа = ТекДанные.ВидЭтапа;
		ЭтоЭтапПротивник = (ТекВидЭтапа = ПредопределенноеЗначение("Перечисление.ВидыЭтаповВосхождения.Противник"));
		Элементы.ТаблицаЭтаповПротивникОписание.Видимость = ЭтоЭтапПротивник;
		ЗагрузитьОписаниеЭтапа(ТекВидЭтапа);
	Иначе
		// Строка не выбрана. Ничего не делаем.
	КонецЕсли;
КонецПроцедуры
